artillery/psu_load_test.yml
config:
  processor: "./psu_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase 1
      duration: 900 # 15 minutes
      arrivalRate: 0
      rampTo: 100
      maxVusers: 100
    - name: hold phase 1
      duration: 900
      arrivalRate: 100
      maxVusers: 100
    - name: ramp up phase 2
      duration: 900
      arrivalRate: 100
      rampTo: 200
      maxVusers: 200
    - name: hold phase 2
      duration: 900
      arrivalRate: 200
      maxVusers: 200
    - name: ramp up phase 3
      duration: 900
      arrivalRate: 200
      rampTo: 300
      maxVusers: 300
    - name: hold phase 3
      duration: 900
      arrivalRate: 300
      maxVusers: 300
    - name: ramp up phase 4
      duration: 900
      arrivalRate: 300
      rampTo: 400
      maxVusers: 400
    - name: hold phase 4
      duration: 900
      arrivalRate: 400
      maxVusers: 400
    - name: ramp up phase 5
      duration: 900
      arrivalRate: 400
      rampTo: 500
      maxVusers: 500
    - name: hold phase 5
      duration: 900
      arrivalRate: 500
      maxVusers: 500

  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
    int:
      target: https://int.api.service.nhs.uk/
    pr:
      target: https://psu-pr-{{ $env.prNumber }}.dev.eps.national.nhs.uk/

before:
  flow:
    - function: "getSharedAuthToken"

scenarios:
  - name: "call psu - successful"
    weight: 90
    tags:
      isValid: true
    beforeRequest: "getPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/prescription-status-update/"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 201

  - name: "call psu - unsuccessful"
    weight: 10
    tags:
      isValid: false
    beforeRequest: "getPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/prescription-status-update/"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 400

  - name: "call check prescription status updates - successful"
    weight: 0
    tags:
      isValid: true
    flow:
      - function: "getSharedAuthToken"
      - get:
          url: "/prescription-status-update/checkprescriptionstatusupdates"
          qs:
            odscode: C9Z1O
            nhsnumber: "9449304130"
            prescriptionid: "16B2E0-A83008-81C13H"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 200

  - name: "get metadata - successful"
    weight: 0
    tags:
      isValid: true
    flow:
      - function: "getSharedAuthToken"
      - get:
          url: "/prescription-status-update/metadata"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 200

  - name: "get status - successful"
    weight: 0
    tags:
      isValid: true
    flow:
      - get:
          url: "/prescription-status-update/_status"
          headers:
            apikey: "{{ $env.status_api_token }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 200