artillery/psu_load_test.yml
config:
  processor: "./helper.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase
      duration: 900
      arrivalRate: 1
      rampTo: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/

before:
  flow:
    - function: "createSharedToken"

scenarios:
  - name: "call psu"
    beforeRequest: "getPSUParams"
    flow:
      - function: "createSharedToken"
      - post:
          url: "/prescription-status-update/"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 201