artillery/psu_load_test.yml
config:
  processor: "./psu_entrypoint.mjs"
  plugins:
    expect: {}
    apdex: {}
  phases:
    - name: ramp up phase
      duration: "{{ $env.rampUpDuration }}"
      arrivalRate: 1
      rampTo: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
    - name: run phase
      duration: "{{ $env.duration }}"
      arrivalRate: "{{ $env.arrivalRate }}"
      maxVusers: "{{ $env.maxVusers }}"
  environments:
    dev:
      target: https://internal-dev.api.service.nhs.uk/
    ref:
      target: https://ref.api.service.nhs.uk/
    int:
      target: https://int.api.service.nhs.uk/

before:
  flow:
    - function: "getSharedAuthToken"

scenarios:
  - name: "call psu - successful"
    weight: 90
    tags:
      isValid: true
    beforeRequest: "getPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/prescription-status-update/"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 201

  - name: "call psu - unsuccessful"
    weight: 10
    tags:
      isValid: false
    beforeRequest: "getPSUParams"
    flow:
      - function: "getSharedAuthToken"
      - post:
          url: "/prescription-status-update/"
          headers:
            Authorization: "Bearer {{ authToken }}"
            x-request-id: "{{ x_request_id }}"
            x-correlation-id: "{{ x_correlation_id }}"
          expect:
            - statusCode: 400